programming/java/code/head-first/head-first.org
#+title: Head First Java
#+options: num:nil ^:nil creator:nil author:nil timestamp:nil

* 01 Breaking the Surface: /a quick dip/

** =BeerSong.java=

#+BEGIN_SRC java -n :bangle BeerSong.java :padline no
  // package chap01;

  public class BeerSong {

    public static void main(String[] args) {

      int beerNum = 99;
      String word = "bottles";

      while (beerNum > 0) {
        if (beerNum == 1) {
          word = "bottle";
        }

        System.out.println(beerNum + " " + word + " of beer on the wall");
        System.out.println(beerNum + " " + word + " of beer");
        System.out.println("Take one down.");
        System.out.println("Pass it around.");
        beerNum = beerNum - 1;

        if (beerNum > 0) {
          System.out.println(beerNum +  " " + word + " of beer on the wall");
        } else {
          System.out.println("No more bottles of beer on the wall");
        }
      }
    }
  
  }
#+END_SRC

