programming/java/code/head-first/head-first.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Head First Java</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Head First Java</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1c59f1b">01 Breaking the Surface: <i>a quick dip</i></a>
<ul>
<li><a href="#org29c2d5a"><code>BeerSong.java</code></a></li>
<li><a href="#orgcf716be"><code>PhraseOMatic.java</code></a></li>
</ul>
</li>
<li><a href="#org34a3a4b">02 A Trip to Objectville: <i>yes, there will be objects</i></a>
<ul>
<li><a href="#org41d8671"><code>Player.java</code></a></li>
<li><a href="#org8f55099"><code>GuessGame.java</code></a></li>
<li><a href="#org5768333"><code>GameLauncher.java</code></a></li>
</ul>
</li>
<li><a href="#org706983a">03 Know Your Variables: <i>primitives and references</i></a>
<ul>
<li><a href="#org530135d"><code>Dog.java</code></a></li>
</ul>
</li>
<li><a href="#org9d34c7c">04 How Objects Behave: <i>object state affects method behavior</i></a>
<ul>
<li><a href="#org0b2b678"><code>Foo.java</code></a></li>
<li><a href="#org1bc10a5"><code>GoodDogTestDrive.java</code></a></li>
<li><a href="#org2faf47b"><code>PoorDogTestDrive.java</code></a></li>
</ul>
</li>
<li><a href="#org289cada">05 Extra-Strength Methods: <i>flow control, operations, and more</i></a>
<ul>
<li><a href="#orgfa3be64"><code>Game.java</code></a></li>
<li><a href="#org922d2a3"><code>GameHelper.java</code></a></li>
<li><a href="#orge4bb9ca"><code>SimpleDotCom.java</code></a></li>
<li><a href="#orga352749"><code>SimpleDotComTester.java</code></a></li>
</ul>
</li>
<li><a href="#org7542608"><span class="todo TODO">TODO</span> 06 Using the Java Library: <i>so you don’t have to write it all yourself</i></a>
<ul>
<li><a href="#org0cf48ee"><code>DotCom.java</code></a></li>
<li><a href="#org4f298d7"><code>DotComBust.java</code></a></li>
<li><a href="#org24fafd0"><code>GameHelper.java</code></a></li>
</ul>
</li>
<li><a href="#orga858eba">07 Better Living in Objectville: <i>planning for the future</i></a>
<ul>
<li><a href="#orgfa044ad"><code>TestBoat.java</code></a></li>
</ul>
</li>
<li><a href="#orgf4707eb">08 Serious Polymorphism: <i>exploiting abstract classes and interfaces</i></a>
<ul>
<li><a href="#org9145132"><code>Of76.java</code></a></li>
</ul>
</li>
<li><a href="#org6988e22">09 Life and Death of an Object: <i>constructors and memory management</i></a>
<ul>
<li><a href="#org28f0cb8"><code>TestLifeSupportSim.java</code></a></li>
</ul>
</li>
<li><a href="#org52e4332">10 Numbers Matter: <i>math, formatting, wrappers, and statics</i></a>
<ul>
<li><a href="#org4db1e8e"><code>FullMoons.java</code></a></li>
</ul>
</li>
<li><a href="#org71e0c12">11 Risky Behavior: <i>exception handling</i></a>
<ul>
<li><a href="#orgbd9514f"><code>MiniMiniMusicApp.java</code></a></li>
<li><a href="#org1b18c0e"><code>MiniMiniMusicCmdLine.java</code></a></li>
</ul>
</li>
<li><a href="#org7cdd8f3">12 A Very Graphic Story: <i>intro to GUI, event handling, and inner classes</i></a>
<ul>
<li><a href="#orgd9267c8"><code>Animate.java</code></a></li>
<li><a href="#orgab8b24b"><code>MiniMusicPlayer3.java</code></a></li>
<li><a href="#org322c46b"><code>SimpleAnimation.java</code></a></li>
<li><a href="#org2b90dc9"><code>TwoButtons.java</code></a></li>
</ul>
</li>
<li><a href="#org0741a28">13 Work on Your Swing: <i>layout managers and components</i></a>
<ul>
<li><a href="#orge2b711b"><code>BeatBox.java</code></a></li>
</ul>
</li>
<li><a href="#org41bdcf3"><span class="todo TODO">TODO</span> 14 Saving Objects: <i>serialization and I/O</i></a>
<ul>
<li><a href="#orge5d0205"><code>chap14/BeatBoxSaveOnly.java</code></a></li>
<li><a href="#orgbc5af05"><code>chap14/DungeonTest.java</code></a></li>
<li><a href="#org9e09f7b"><code>chap14/GameCharacter.java</code></a></li>
<li><a href="#org6287ef8"><code>chap14/GameSaverTest.java</code></a></li>
<li><a href="#org93334a4"><code>chap14/QuizCard.java</code></a></li>
<li><a href="#org9ac4fa8"><code>chap14/QuizCardBuilder.java</code></a></li>
<li><a href="#orgfbc9543"><code>chap14/QuizCardReader.java</code></a></li>
</ul>
</li>
<li><a href="#org82c90e9"><span class="todo TODO">TODO</span> 15 Make a Connection: <i>networking sockets and multithreading</i></a>
<ul>
<li><a href="#org8529d28"><code>chap15/DailyAdviceClient.java</code></a></li>
<li><a href="#org54e7c85"><code>chap15/DailyAdviceServer.java</code></a></li>
<li><a href="#orgd6ba790"><code>chap15/MyRunnable.java</code></a></li>
<li><a href="#org3ba0725"><code>chap15/RunThreads.java</code></a></li>
<li><a href="#org8d42b51"><code>chap15/RyanAndMonicaJob.java</code></a></li>
<li><a href="#orgb4a86d5"><code>chap15/SimpleChatClient.java</code></a></li>
<li><a href="#orgef7466c"><code>chap15/SimpleChatClientA.java</code></a></li>
<li><a href="#org3169c70"><code>chap15/VerySimpleChatServer.java</code></a></li>
</ul>
</li>
<li><a href="#org64b0f87">16 Data Structures: <i>collections and generics</i></a>
<ul>
<li><a href="#orge8855d3"><code>chap16/Jukebox1.java</code></a></li>
<li><a href="#org9eeb054"><code>chap16/Jukebox3.java</code></a></li>
<li><a href="#org2e98357"><code>chap16/Jukebox5.java</code></a></li>
<li><a href="#org2caebec"><code>chap16/Jukebox6.java</code></a></li>
<li><a href="#org6a06859"><code>chap16/Jukebox8.java</code></a></li>
<li><a href="#org1e09699"><code>chap16/Song.java</code></a></li>
<li><a href="#orgaeb72d4"><code>SongList.txt</code></a></li>
<li><a href="#orgf65b703"><code>SongListMore.txt</code></a></li>
</ul>
</li>
<li><a href="#orgafbc5ac">17 Release Your Code: <i>packaging and deployment</i></a></li>
<li><a href="#orgf9f795a">18 Distributed Computing: <i>RMI with a dash of servlets, EJB, and Jini</i></a>
<ul>
<li><a href="#orgd5d0979"><code>PhraseOMatic2.java</code></a></li>
<li><a href="#org1f57057"><code>KathyServlet.java</code></a></li>
<li><a href="#org0790034"><code>ServiceServer.java</code> (the remote interface)</a></li>
<li><a href="#orged4184e"><code>Service.java</code> (what the GUI services implement)</a></li>
<li><a href="#org9094326"><code>ServiceServerImpl.java</code> (the remote implementation)</a></li>
<li><a href="#org2bf5df9"><code>ServiceBrowser.java</code> (the client)</a></li>
<li><a href="#org466f2f5"><code>DiceService.java</code> (a universal service, implements Service)</a></li>
<li><a href="#org833e76d"><code>MiniMusicService.java</code> (a universal service, implements Service)</a></li>
<li><a href="#orgf1689cc"><code>DayOfTheWeekService.java</code> (a universal service, implements Service)</a></li>
</ul>
</li>
<li><a href="#org68c69b7"><span class="todo TODO">TODO</span> A Appendix A: <i>Final code kitchen</i></a>
<ul>
<li><a href="#org6e82ac8"><code>AppendixA/BeatBoxFinal.java</code></a></li>
<li><a href="#orgcfc65a7"><code>AppendixA/MusicServer.java</code></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1c59f1b" class="outline-2">
<h2 id="org1c59f1b">01 Breaking the Surface: <i>a quick dip</i></h2>
<div class="outline-text-2" id="text-org1c59f1b">
</div>
<div id="outline-container-org29c2d5a" class="outline-3">
<h3 id="org29c2d5a"><code>BeerSong.java</code></h3>
<div class="outline-text-3" id="text-org29c2d5a">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">package chap01;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">BeerSong</span> {
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">beerNum</span> = 99;
<span class="linenr"> 8: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">word</span> = <span style="color: #848ea9;">"bottles"</span>;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (beerNum &gt; 0) {
<span class="linenr">11: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (beerNum == 1) {
<span class="linenr">12: </span>        word = <span style="color: #848ea9;">"bottle"</span>;
<span class="linenr">13: </span>      }
<span class="linenr">14: </span>
<span class="linenr">15: </span>      System.out.println(beerNum + <span style="color: #848ea9;">" "</span> + word + <span style="color: #848ea9;">" of beer on the wall"</span>);
<span class="linenr">16: </span>      System.out.println(beerNum + <span style="color: #848ea9;">" "</span> + word + <span style="color: #848ea9;">" of beer"</span>);
<span class="linenr">17: </span>      System.out.println(<span style="color: #848ea9;">"Take one down."</span>);
<span class="linenr">18: </span>      System.out.println(<span style="color: #848ea9;">"Pass it around."</span>);
<span class="linenr">19: </span>      beerNum = beerNum - 1;
<span class="linenr">20: </span>
<span class="linenr">21: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (beerNum &gt; 0) {
<span class="linenr">22: </span>        System.out.println(beerNum +  <span style="color: #848ea9;">" "</span> + word + <span style="color: #848ea9;">" of beer on the wall"</span>);
<span class="linenr">23: </span>      } <span style="color: #56b4e9; font-weight: bold;">else</span> {
<span class="linenr">24: </span>        System.out.println(<span style="color: #848ea9;">"No more bottles of beer on the wall"</span>);
<span class="linenr">25: </span>      }
<span class="linenr">26: </span>    }
<span class="linenr">27: </span>  }
<span class="linenr">28: </span>
<span class="linenr">29: </span>}
</pre>
</div>
</div>
</div>
