programming/java/code/head-first/head-first.org
** =PhraseOMatic.java=

#+BEGIN_SRC java -n :bangle PhraseOMatic.java :padline no
  // package chap01;

  public class PhraseOMatic {
  
    public static void main(String[] args) {

      String[] wordListOne = {"24/7", "multi-Tier", "30,000 foot", "B-to-B",
                              "win-win", "front-end", "web-based", "pervasive",
                              "smart", "six-sigma", "critical-path", "dynamic"};
      String[] wordListTwo = {"empowered", "sticky", "value-added", "oriented",
                              "centric", "distributed", "clustered", "branded",
                              "outside-the-box", "positioned", "networked", 
                              "focused", "leveraged", "aligned", "targeted",
                              "shared", "cooperative", "accelerated"};
      String[] wordListThree = {"process", "tipping-point", "solution",
                                "architecture", "core competency", "strategy",
                                "mindshare", "portal", "space", "vision", "paradigm",
                                "mission"};
      int oneLength = wordListOne.length;
      int twoLength = wordListTwo.length;
      int threeLength = wordListThree.length;
      int rand1 = (int) (Math.random() * oneLength);
      int rand2 = (int) (Math.random() * twoLength);
      int rand3 = (int) (Math.random() * threeLength);

      String phrase = wordListOne[rand1] + " " + wordListTwo[rand2] + " "
          + wordListThree[rand3];
      System.out.println("What we need is a " + phrase);
    }

  }
#+END_SRC

* 02 A Trip to Objectville: /yes, there will be objects/

** =Player.java=

#+BEGIN_SRC java -n :bangle Player.java :padline no
  // package chap02;

  public class Player {

    int number = 0;

    public void guess() {
      number = (int) (Math.random() * 10);
      System.out.println("I'm guessing " + number);
    }
  }
#+END_SRC

