programming/java/code/head-first/head-first.html

<div id="outline-container-orgcf716be" class="outline-3">
<h3 id="orgcf716be"><code>PhraseOMatic.java</code></h3>
<div class="outline-text-3" id="text-orgcf716be">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">package chap01;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">PhraseOMatic</span> {
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">wordListOne</span> = {<span style="color: #848ea9;">"24/7"</span>, <span style="color: #848ea9;">"multi-Tier"</span>, <span style="color: #848ea9;">"30,000 foot"</span>, <span style="color: #848ea9;">"B-to-B"</span>,
<span class="linenr"> 8: </span>                            <span style="color: #848ea9;">"win-win"</span>, <span style="color: #848ea9;">"front-end"</span>, <span style="color: #848ea9;">"web-based"</span>, <span style="color: #848ea9;">"pervasive"</span>,
<span class="linenr"> 9: </span>                            <span style="color: #848ea9;">"smart"</span>, <span style="color: #848ea9;">"six-sigma"</span>, <span style="color: #848ea9;">"critical-path"</span>, <span style="color: #848ea9;">"dynamic"</span>};
<span class="linenr">10: </span>    <span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">wordListTwo</span> = {<span style="color: #848ea9;">"empowered"</span>, <span style="color: #848ea9;">"sticky"</span>, <span style="color: #848ea9;">"value-added"</span>, <span style="color: #848ea9;">"oriented"</span>,
<span class="linenr">11: </span>                            <span style="color: #848ea9;">"centric"</span>, <span style="color: #848ea9;">"distributed"</span>, <span style="color: #848ea9;">"clustered"</span>, <span style="color: #848ea9;">"branded"</span>,
<span class="linenr">12: </span>                            <span style="color: #848ea9;">"outside-the-box"</span>, <span style="color: #848ea9;">"positioned"</span>, <span style="color: #848ea9;">"networked"</span>, 
<span class="linenr">13: </span>                            <span style="color: #848ea9;">"focused"</span>, <span style="color: #848ea9;">"leveraged"</span>, <span style="color: #848ea9;">"aligned"</span>, <span style="color: #848ea9;">"targeted"</span>,
<span class="linenr">14: </span>                            <span style="color: #848ea9;">"shared"</span>, <span style="color: #848ea9;">"cooperative"</span>, <span style="color: #848ea9;">"accelerated"</span>};
<span class="linenr">15: </span>    <span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">wordListThree</span> = {<span style="color: #848ea9;">"process"</span>, <span style="color: #848ea9;">"tipping-point"</span>, <span style="color: #848ea9;">"solution"</span>,
<span class="linenr">16: </span>                              <span style="color: #848ea9;">"architecture"</span>, <span style="color: #848ea9;">"core competency"</span>, <span style="color: #848ea9;">"strategy"</span>,
<span class="linenr">17: </span>                              <span style="color: #848ea9;">"mindshare"</span>, <span style="color: #848ea9;">"portal"</span>, <span style="color: #848ea9;">"space"</span>, <span style="color: #848ea9;">"vision"</span>, <span style="color: #848ea9;">"paradigm"</span>,
<span class="linenr">18: </span>                              <span style="color: #848ea9;">"mission"</span>};
<span class="linenr">19: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">oneLength</span> = wordListOne.length;
<span class="linenr">20: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">twoLength</span> = wordListTwo.length;
<span class="linenr">21: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">threeLength</span> = wordListThree.length;
<span class="linenr">22: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">rand1</span> = (<span style="color: #0072b2; font-weight: bold;">int</span>) (Math.random() * oneLength);
<span class="linenr">23: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">rand2</span> = (<span style="color: #0072b2; font-weight: bold;">int</span>) (Math.random() * twoLength);
<span class="linenr">24: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">rand3</span> = (<span style="color: #0072b2; font-weight: bold;">int</span>) (Math.random() * threeLength);
<span class="linenr">25: </span>
<span class="linenr">26: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">phrase</span> = wordListOne[rand1] + <span style="color: #848ea9;">" "</span> + wordListTwo[rand2] + <span style="color: #848ea9;">" "</span>
<span class="linenr">27: </span>        + wordListThree[rand3];
<span class="linenr">28: </span>    System.out.println(<span style="color: #848ea9;">"What we need is a "</span> + phrase);
<span class="linenr">29: </span>  }
<span class="linenr">30: </span>
<span class="linenr">31: </span>}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org34a3a4b" class="outline-2">
<h2 id="org34a3a4b">02 A Trip to Objectville: <i>yes, there will be objects</i></h2>
<div class="outline-text-2" id="text-org34a3a4b">
</div>
<div id="outline-container-org41d8671" class="outline-3">
<h3 id="org41d8671"><code>Player.java</code></h3>
<div class="outline-text-3" id="text-org41d8671">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">package chap02;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Player</span> {
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">number</span> = 0;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">guess</span>() {
<span class="linenr"> 8: </span>    number = (<span style="color: #0072b2; font-weight: bold;">int</span>) (Math.random() * 10);
<span class="linenr"> 9: </span>    System.out.println(<span style="color: #848ea9;">"I'm guessing "</span> + number);
<span class="linenr">10: </span>  }
<span class="linenr">11: </span>}
</pre>
</div>
</div>
</div>
