programming/java/code/head-first/head-first.org
** =Game.java=

#+BEGIN_SRC java -n :bangle Game.java :padline no
  // package chap05;

  // import helpers.GameHelper;
  // import GameHelper;

  import java.util.Scanner;

  public class Game {

    public static void main(String[] args) {
      int numOfGuesses = 0;
      GameHelper helper = new GameHelper();

      SimpleDotCom theDotCom = new SimpleDotCom();
      int randomNum = (int) (Math.random() * 5);

      int[] locations = {randomNum, randomNum + 1, randomNum + 2};
      theDotCom.setLocationCells(locations);
      boolean isAlive = true;

      while (isAlive == true) {
        String guess = helper.getUserInput("enter a number");
        String result = theDotCom.checkYourself(guess);
        numOfGuesses++;

        if (result.equals("kill")) {
          isAlive = false;
          System.out.println("You took " + numOfGuesses + " guesses");
        }
      }
    }

  }
#+END_SRC

