programming/java/code/head-first/head-first.html
<div id="outline-container-orgfa3be64" class="outline-3">
<h3 id="orgfa3be64"><code>Game.java</code></h3>
<div class="outline-text-3" id="text-orgfa3be64">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">package chap05;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">import helpers.GameHelper;</span>
<span class="linenr"> 4: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">import GameHelper;</span>
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Scanner</span>;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Game</span> {
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">numOfGuesses</span> = 0;
<span class="linenr">12: </span>    <span style="color: #0072b2; font-weight: bold;">GameHelper</span> <span style="color: #e69f00; font-weight: bold;">helper</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">GameHelper</span>();
<span class="linenr">13: </span>
<span class="linenr">14: </span>    <span style="color: #0072b2; font-weight: bold;">SimpleDotCom</span> <span style="color: #e69f00; font-weight: bold;">theDotCom</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">SimpleDotCom</span>();
<span class="linenr">15: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">randomNum</span> = (<span style="color: #0072b2; font-weight: bold;">int</span>) (Math.random() * 5);
<span class="linenr">16: </span>
<span class="linenr">17: </span>    <span style="color: #0072b2; font-weight: bold;">int</span>[] <span style="color: #e69f00; font-weight: bold;">locations</span> = {randomNum, randomNum + 1, randomNum + 2};
<span class="linenr">18: </span>    theDotCom.setLocationCells(locations);
<span class="linenr">19: </span>    <span style="color: #0072b2; font-weight: bold;">boolean</span> <span style="color: #e69f00; font-weight: bold;">isAlive</span> = <span style="color: #d55e00; font-weight: bold;">true</span>;
<span class="linenr">20: </span>
<span class="linenr">21: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (isAlive == <span style="color: #d55e00; font-weight: bold;">true</span>) {
<span class="linenr">22: </span>      <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">guess</span> = helper.getUserInput(<span style="color: #848ea9;">"enter a number"</span>);
<span class="linenr">23: </span>      <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">result</span> = theDotCom.checkYourself(guess);
<span class="linenr">24: </span>      numOfGuesses++;
<span class="linenr">25: </span>
<span class="linenr">26: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (result.equals(<span style="color: #848ea9;">"kill"</span>)) {
<span class="linenr">27: </span>        isAlive = <span style="color: #d55e00; font-weight: bold;">false</span>;
<span class="linenr">28: </span>        System.out.println(<span style="color: #848ea9;">"You took "</span> + numOfGuesses + <span style="color: #848ea9;">" guesses"</span>);
<span class="linenr">29: </span>      }
<span class="linenr">30: </span>    }
<span class="linenr">31: </span>  }
<span class="linenr">32: </span>
<span class="linenr">33: </span>}
</pre>
</div>
</div>
</div>
