programming/java/code/head-first/head-first.html

<div id="outline-container-org922d2a3" class="outline-3">
<h3 id="org922d2a3"><code>GameHelper.java</code></h3>
<div class="outline-text-3" id="text-org922d2a3">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">package chap05;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">BufferedReader</span>;
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">IOException</span>;
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">InputStreamReader</span>;
<span class="linenr"> 6: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">ArrayList</span>;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">GameHelper</span> {
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #56b4e9; font-weight: bold;">final</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">alphabet</span> = <span style="color: #848ea9;">"abcdefg"</span>;
<span class="linenr">11: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">gridLength</span> = 7;
<span class="linenr">12: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">gridSize</span> = 49;
<span class="linenr">13: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">int</span> [] <span style="color: #e69f00; font-weight: bold;">grid</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">int</span>[gridSize];
<span class="linenr">14: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">comCount</span> = 0;
<span class="linenr">15: </span>
<span class="linenr">16: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">getUserInput</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">prompt</span>) {
<span class="linenr">17: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">inputLine</span> = <span style="color: #d55e00; font-weight: bold;">null</span>;
<span class="linenr">18: </span>    System.out.print(prompt + <span style="color: #848ea9;">"  "</span>);
<span class="linenr">19: </span>    <span style="color: #56b4e9; font-weight: bold;">try</span> {
<span class="linenr">20: </span>      <span style="color: #0072b2; font-weight: bold;">BufferedReader</span> <span style="color: #e69f00; font-weight: bold;">is</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">BufferedReader</span>(
<span class="linenr">21: </span>          <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">InputStreamReader</span>(System.in));
<span class="linenr">22: </span>      inputLine = is.readLine();
<span class="linenr">23: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (inputLine.length() == 0) {
<span class="linenr">24: </span>        <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #d55e00; font-weight: bold;">null</span>;
<span class="linenr">25: </span>      }
<span class="linenr">26: </span>    } <span style="color: #56b4e9; font-weight: bold;">catch</span> (<span style="color: #0072b2; font-weight: bold;">IOException</span> <span style="color: #e69f00; font-weight: bold;">e</span>) {
<span class="linenr">27: </span>      System.out.println(<span style="color: #848ea9;">"IOException: "</span> + e);
<span class="linenr">28: </span>    }
<span class="linenr">29: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> inputLine.toLowerCase();
<span class="linenr">30: </span>  }
<span class="linenr">31: </span>
<span class="linenr">32: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">ArrayList</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>&gt; <span style="color: #d55e00;">placeDotCom</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">comSize</span>) { <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">line 19</span>
<span class="linenr">33: </span>    <span style="color: #0072b2; font-weight: bold;">ArrayList</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>&gt; <span style="color: #e69f00; font-weight: bold;">alphaCells</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">ArrayList</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>&gt;();
<span class="linenr">34: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> [] <span style="color: #e69f00; font-weight: bold;">alphacoords</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">String</span> [comSize];     <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">holds 'f6' type coords</span>
<span class="linenr">35: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">temp</span> = <span style="color: #d55e00; font-weight: bold;">null</span>;                               <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">temporary String for concat</span>
<span class="linenr">36: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> [] <span style="color: #e69f00; font-weight: bold;">coords</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">int</span>[comSize];                 <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">current candidate coords</span>
<span class="linenr">37: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">attempts</span> = 0;                                 <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">current attempts counter</span>
<span class="linenr">38: </span>    <span style="color: #0072b2; font-weight: bold;">boolean</span> <span style="color: #e69f00; font-weight: bold;">success</span> = <span style="color: #d55e00; font-weight: bold;">false</span>;                          <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">flag = found a good location ?</span>
<span class="linenr">39: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">location</span> = 0;                                 <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">current starting location</span>
<span class="linenr">40: </span>
<span class="linenr">41: </span>    comCount++;                                       <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">nth dot com to place</span>
<span class="linenr">42: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">incr</span> = 1;                                     <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">set horizontal increment</span>
<span class="linenr">43: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> ((comCount % 2) == 1) {                        <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">if odd dot com  (place vertically)</span>
<span class="linenr">44: </span>      incr = gridLength;                              <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">set vertical increment</span>
<span class="linenr">45: </span>    }
<span class="linenr">46: </span>
<span class="linenr">47: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (!success &amp; attempts++ &lt; 200) {             <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">main search loop  (32)</span>
<span class="linenr">48: </span>      location = (<span style="color: #0072b2; font-weight: bold;">int</span>) (Math.random() * gridSize);    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">get random starting point</span>
<span class="linenr">49: </span>      <span style="color: #009e73; font-style: italic;">//</span><span style="color: #009e73; font-style: italic;">System.out.print(" try " + location);</span>
<span class="linenr">50: </span>      <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">x</span> = 0;                                      <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">nth position in dotcom to place</span>
<span class="linenr">51: </span>      success = <span style="color: #d55e00; font-weight: bold;">true</span>;                                 <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">assume success</span>
<span class="linenr">52: </span>      <span style="color: #56b4e9; font-weight: bold;">while</span> (success &amp;&amp; x &lt; <span style="color: #0072b2; font-weight: bold;">comSize</span>) {                <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">look for adjacent unused spots</span>
<span class="linenr">53: </span>        <span style="color: #56b4e9; font-weight: bold;">if</span> (grid[location] == 0) {                    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">if not already used</span>
<span class="linenr">54: </span>          coords[x++] = location;                     <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">save location</span>
<span class="linenr">55: </span>          location += incr;                           <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">try 'next' adjacent</span>
<span class="linenr">56: </span>          <span style="color: #56b4e9; font-weight: bold;">if</span> (location &gt;= gridSize) {                 <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">out of bounds - 'bottom'</span>
<span class="linenr">57: </span>            success = <span style="color: #d55e00; font-weight: bold;">false</span>;                          <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">failure</span>
<span class="linenr">58: </span>          }
<span class="linenr">59: </span>          <span style="color: #56b4e9; font-weight: bold;">if</span> (x &gt; 0 &amp; (location % gridLength == 0)) { <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">out of bounds - right edge</span>
<span class="linenr">60: </span>            success = <span style="color: #d55e00; font-weight: bold;">false</span>;                          <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">failure</span>
<span class="linenr">61: </span>          }
<span class="linenr">62: </span>        } <span style="color: #56b4e9; font-weight: bold;">else</span> {                                      <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">found already used location</span>
<span class="linenr">63: </span>          <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">System.out.print(" used " + location);  </span>
<span class="linenr">64: </span>          success = <span style="color: #d55e00; font-weight: bold;">false</span>;                            <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">failure</span>
<span class="linenr">65: </span>        }
<span class="linenr">66: </span>      }
<span class="linenr">67: </span>    }                                                 <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">end while</span>
<span class="linenr">68: </span>
<span class="linenr">69: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">x</span> = 0;                                        <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">turn good location into alpha coords</span>
<span class="linenr">70: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">row</span> = 0;
<span class="linenr">71: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">column</span> = 0;
<span class="linenr">72: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">System.out.println("\n");</span>
<span class="linenr">73: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (x &lt; <span style="color: #0072b2; font-weight: bold;">comSize</span>) {
<span class="linenr">74: </span>      grid[coords[x]] = 1;                            <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">mark master grid pts. as 'used'</span>
<span class="linenr">75: </span>      row = (<span style="color: #0072b2; font-weight: bold;">int</span>) (coords[x] / gridLength);           <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">get row value</span>
<span class="linenr">76: </span>      column = coords[x] % gridLength;                <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">get numeric column value</span>
<span class="linenr">77: </span>      temp = String.valueOf(alphabet.charAt(column)); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">convert to alpha</span>
<span class="linenr">78: </span>
<span class="linenr">79: </span>      alphaCells.add(temp.concat(Integer.toString(row)));
<span class="linenr">80: </span>      x++;
<span class="linenr">81: </span>      <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">System.out.print("  coord "+x+" = " + alphaCells.get(x-1));</span>
<span class="linenr">82: </span>
<span class="linenr">83: </span>    }
<span class="linenr">84: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">System.out.println("\n");</span>
<span class="linenr">85: </span>
<span class="linenr">86: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> alphaCells;
<span class="linenr">87: </span>  }
<span class="linenr">88: </span>
<span class="linenr">89: </span>}
</pre>
</div>
</div>
</div>
