programming/java/code/head-first/head-first.html

<div id="outline-container-org4f298d7" class="outline-3">
<h3 id="org4f298d7"><code>DotComBust.java</code></h3>
<div class="outline-text-3" id="text-org4f298d7">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">package chap06;</span>
<span class="linenr"> 2: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">import helpers.GameHelper;</span>
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">ArrayList</span>;
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Iterator</span>;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">DotComBust</span> {
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">GameHelper</span> <span style="color: #e69f00; font-weight: bold;">helper</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">GameHelper</span>();
<span class="linenr">10: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">ArrayList</span>&lt;<span style="color: #0072b2; font-weight: bold;">DotCom</span>&gt; <span style="color: #e69f00; font-weight: bold;">dotComsList</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">ArrayList</span>&lt;<span style="color: #0072b2; font-weight: bold;">DotCom</span>&gt;();
<span class="linenr">11: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">numOfGuesses</span> = 0;
<span class="linenr">12: </span>
<span class="linenr">13: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">setUpGame</span>() {
<span class="linenr">14: </span>    <span style="color: #0072b2; font-weight: bold;">DotCom</span> <span style="color: #e69f00; font-weight: bold;">one</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">DotCom</span>();
<span class="linenr">15: </span>    one.setName(<span style="color: #848ea9;">"Pets.com"</span>);
<span class="linenr">16: </span>    <span style="color: #0072b2; font-weight: bold;">DotCom</span> <span style="color: #e69f00; font-weight: bold;">two</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">DotCom</span>();
<span class="linenr">17: </span>    two.setName(<span style="color: #848ea9;">"eToys.com"</span>);
<span class="linenr">18: </span>    <span style="color: #0072b2; font-weight: bold;">DotCom</span> <span style="color: #e69f00; font-weight: bold;">three</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">DotCom</span>();
<span class="linenr">19: </span>    three.setName(<span style="color: #848ea9;">"Go2.com"</span>);
<span class="linenr">20: </span>    dotComsList.add(one);
<span class="linenr">21: </span>    dotComsList.add(two);
<span class="linenr">22: </span>    dotComsList.add(three);
<span class="linenr">23: </span>
<span class="linenr">24: </span>    System.out.println(<span style="color: #848ea9;">"Your goal is to sink three dot coms."</span>);
<span class="linenr">25: </span>    System.out.println(<span style="color: #848ea9;">"Pets.com, eToys.com, Go2.com"</span>);
<span class="linenr">26: </span>    System.out.println(<span style="color: #848ea9;">"Try to sink them all in the fewest number of guesses"</span>);
<span class="linenr">27: </span>
<span class="linenr">28: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">DotCom</span> <span style="color: #e69f00; font-weight: bold;">dotComSet</span> : dotComsList) {
<span class="linenr">29: </span>      <span style="color: #0072b2; font-weight: bold;">ArrayList</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>&gt; <span style="color: #e69f00; font-weight: bold;">newLocation</span> = helper.placeDotCom(3);
<span class="linenr">30: </span>      dotComSet.setLocationCells(newLocation);
<span class="linenr">31: </span>    }
<span class="linenr">32: </span>  }
<span class="linenr">33: </span>
<span class="linenr">34: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">startPlaying</span>() {
<span class="linenr">35: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (!dotComsList.isEmpty()) {
<span class="linenr">36: </span>      <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">userGuess</span> = helper.getUserInput(<span style="color: #848ea9;">"Enter a guess"</span>);
<span class="linenr">37: </span>      checkUserGuess(userGuess);
<span class="linenr">38: </span>    }
<span class="linenr">39: </span>    finishGame();
<span class="linenr">40: </span>  }
<span class="linenr">41: </span>
<span class="linenr">42: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">checkUserGuess</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">userGuess</span>) {
<span class="linenr">43: </span>    numOfGuesses++;
<span class="linenr">44: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">result</span> = <span style="color: #848ea9;">"miss"</span>;
<span class="linenr">45: </span>
<span class="linenr">46: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">DotCom</span> <span style="color: #e69f00; font-weight: bold;">dotComToTest</span> : dotComsList) {
<span class="linenr">47: </span>      result = dotComToTest.checkYourself(userGuess);
<span class="linenr">48: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (result.equals(<span style="color: #848ea9;">"hit"</span>)) {
<span class="linenr">49: </span>        <span style="color: #56b4e9; font-weight: bold;">break</span>;
<span class="linenr">50: </span>      }
<span class="linenr">51: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (result.equals(<span style="color: #848ea9;">"kill"</span>)) {
<span class="linenr">52: </span>        dotComsList.remove(dotComToTest);
<span class="linenr">53: </span>        <span style="color: #56b4e9; font-weight: bold;">break</span>;
<span class="linenr">54: </span>      }
<span class="linenr">55: </span>    }
<span class="linenr">56: </span>    System.out.println(result);
<span class="linenr">57: </span>  }
<span class="linenr">58: </span>
<span class="linenr">59: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">finishGame</span>() {
<span class="linenr">60: </span>    System.out.println(<span style="color: #848ea9;">"All Dot Coms are dead!  Your stock is now worthless"</span>);
<span class="linenr">61: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> (numOfGuesses &lt;= 18) {
<span class="linenr">62: </span>      System.out.println(<span style="color: #848ea9;">"It only took you "</span> + numOfGuesses + <span style="color: #848ea9;">" guesses"</span>);
<span class="linenr">63: </span>      System.out.println(<span style="color: #848ea9;">"You got out before your options sank."</span>);
<span class="linenr">64: </span>    } <span style="color: #56b4e9; font-weight: bold;">else</span> {
<span class="linenr">65: </span>      System.out.println(<span style="color: #848ea9;">"Took you long enough. "</span> + numOfGuesses + <span style="color: #848ea9;">" guesses."</span>);
<span class="linenr">66: </span>      System.out.println(<span style="color: #848ea9;">"Fish are dancing with your options."</span>);
<span class="linenr">67: </span>    }
<span class="linenr">68: </span>  }
<span class="linenr">69: </span>
<span class="linenr">70: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">71: </span>    <span style="color: #0072b2; font-weight: bold;">DotComBust</span> <span style="color: #e69f00; font-weight: bold;">game</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">DotComBust</span>();
<span class="linenr">72: </span>    game.setUpGame();
<span class="linenr">73: </span>    game.startPlaying();
<span class="linenr">74: </span>  }
<span class="linenr">75: </span>
<span class="linenr">76: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org24fafd0" class="outline-3">
<h3 id="org24fafd0"><code>GameHelper.java</code></h3>
<div class="outline-text-3" id="text-org24fafd0">
<p>
chapter 5
</p>
</div>
</div>
</div>

<div id="outline-container-orga858eba" class="outline-2">
<h2 id="orga858eba">07 Better Living in Objectville: <i>planning for the future</i></h2>
<div class="outline-text-2" id="text-orga858eba">
</div>
