programming/java/code/head-first/head-first.html

<div id="outline-container-org82c90e9" class="outline-2">
<h2 id="org82c90e9"><span class="todo TODO">TODO</span> 15 Make a Connection: <i>networking sockets and multithreading</i></h2>
<div class="outline-text-2" id="text-org82c90e9">
</div>
<div id="outline-container-org8529d28" class="outline-3">
<h3 id="org8529d28"><code>chap15/DailyAdviceClient.java</code></h3>
<div class="outline-text-3" id="text-org8529d28">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">package</span> <span style="color: #d55e00; font-weight: bold;">chap15</span>;
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.*;
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">net</span>.*;
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">DailyAdviceClient</span>
<span class="linenr"> 7: </span>{
<span class="linenr"> 8: </span>    <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">go</span>() {
<span class="linenr"> 9: </span>        <span style="color: #56b4e9; font-weight: bold;">try</span> {
<span class="linenr">10: </span>            <span style="color: #0072b2; font-weight: bold;">Socket</span> <span style="color: #e69f00; font-weight: bold;">s</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Socket</span>(<span style="color: #848ea9;">"127.0.0.1"</span>, 4242);
<span class="linenr">11: </span>            <span style="color: #0072b2; font-weight: bold;">InputStreamReader</span> <span style="color: #e69f00; font-weight: bold;">streamReader</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">InputStreamReader</span>(s.getInputStream()); 
<span class="linenr">12: </span>            <span style="color: #0072b2; font-weight: bold;">BufferedReader</span> <span style="color: #e69f00; font-weight: bold;">reader</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">BufferedReader</span>(streamReader);
<span class="linenr">13: </span>
<span class="linenr">14: </span>            <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">advice</span> = reader.readLine();
<span class="linenr">15: </span>            System.out.println(<span style="color: #848ea9;">"Today you should: "</span> + advice);
<span class="linenr">16: </span>            reader.close();
<span class="linenr">17: </span>        }
<span class="linenr">18: </span>        <span style="color: #56b4e9; font-weight: bold;">catch</span> (<span style="color: #0072b2; font-weight: bold;">IOException</span> <span style="color: #e69f00; font-weight: bold;">ex</span>)
<span class="linenr">19: </span>        {
<span class="linenr">20: </span>            ex.printStackTrace();
<span class="linenr">21: </span>        }
<span class="linenr">22: </span>    }
<span class="linenr">23: </span>
<span class="linenr">24: </span>    <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>)
<span class="linenr">25: </span>    {
<span class="linenr">26: </span>        <span style="color: #0072b2; font-weight: bold;">DailyAdviceClient</span> <span style="color: #e69f00; font-weight: bold;">client</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">DailyAdviceClient</span>();
<span class="linenr">27: </span>        client.go();
<span class="linenr">28: </span>    }
<span class="linenr">29: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org54e7c85" class="outline-3">
<h3 id="org54e7c85"><code>chap15/DailyAdviceServer.java</code></h3>
<div class="outline-text-3" id="text-org54e7c85">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">package</span> <span style="color: #d55e00; font-weight: bold;">chap15</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.*;
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">net</span>.*;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">DailyAdviceServer</span>
<span class="linenr"> 6: </span>{
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">adviceList</span> = {<span style="color: #848ea9;">"Take smaller bites"</span>, <span style="color: #848ea9;">"Go for the tight jeans. No they do NOT make you look fat"</span>,
<span class="linenr"> 8: </span>        <span style="color: #848ea9;">"One word: inappropriate"</span>, <span style="color: #848ea9;">"Just for today, be honest.  Tell your boss what you *really* think"</span>, 
<span class="linenr"> 9: </span>        <span style="color: #848ea9;">"You might want to rethink that haircut"</span>};
<span class="linenr">10: </span>
<span class="linenr">11: </span>    <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">go</span>() {
<span class="linenr">12: </span>        <span style="color: #56b4e9; font-weight: bold;">try</span> {
<span class="linenr">13: </span>            <span style="color: #0072b2; font-weight: bold;">ServerSocket</span> <span style="color: #e69f00; font-weight: bold;">serverSock</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">ServerSocket</span>(4242);
<span class="linenr">14: </span>            <span style="color: #56b4e9; font-weight: bold;">while</span> (<span style="color: #d55e00; font-weight: bold;">true</span>)
<span class="linenr">15: </span>            {
<span class="linenr">16: </span>                <span style="color: #0072b2; font-weight: bold;">Socket</span> <span style="color: #e69f00; font-weight: bold;">sock</span> = serverSock.accept();
<span class="linenr">17: </span>
<span class="linenr">18: </span>                <span style="color: #0072b2; font-weight: bold;">PrintWriter</span> <span style="color: #e69f00; font-weight: bold;">writer</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">PrintWriter</span>(sock.getOutputStream());
<span class="linenr">19: </span>                <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">advice</span> = getAdvice();
<span class="linenr">20: </span>                writer.println(advice);
<span class="linenr">21: </span>                writer.close();
<span class="linenr">22: </span>                System.out.println(advice);
<span class="linenr">23: </span>            }
<span class="linenr">24: </span>        } <span style="color: #56b4e9; font-weight: bold;">catch</span> (<span style="color: #0072b2; font-weight: bold;">IOException</span> <span style="color: #e69f00; font-weight: bold;">ex</span>)
<span class="linenr">25: </span>        {
<span class="linenr">26: </span>            ex.printStackTrace();
<span class="linenr">27: </span>        }
<span class="linenr">28: </span>    }
<span class="linenr">29: </span>
<span class="linenr">30: </span>    <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">getAdvice</span>() {
<span class="linenr">31: </span>        <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">random</span> = (<span style="color: #0072b2; font-weight: bold;">int</span>) (Math.random() * adviceList.length);
<span class="linenr">32: </span>        <span style="color: #56b4e9; font-weight: bold;">return</span> adviceList[random];
<span class="linenr">33: </span>    }
<span class="linenr">34: </span>
<span class="linenr">35: </span>    <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>)
<span class="linenr">36: </span>    {
<span class="linenr">37: </span>        <span style="color: #0072b2; font-weight: bold;">DailyAdviceServer</span> <span style="color: #e69f00; font-weight: bold;">server</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">DailyAdviceServer</span>();
<span class="linenr">38: </span>        server.go();
<span class="linenr">39: </span>    }
<span class="linenr">40: </span>
<span class="linenr">41: </span>}
</pre>
</div>
</div>
</div>
