programming/java/code/head-first/head-first.org
** =chap16/Song.java=

#+BEGIN_SRC java -n :tangle Song.java :padline no
  // package chap16;

  public class Song implements Comparable<Song> {
    String title;
    String artist;
    String rating;
    String bpm;

    /** . */
    public Song(String t, String a, String r, String b) {
      title = t;
      artist = a;
      rating = r;
      bpm = b;
    }

    public boolean equals(Object aSong) {
      Song s = (Song) aSong;
      return getTitle().equals(s.getTitle());
    }

    public int hashCode() {
      return title.hashCode();
    }

    public int compareTo(Song s) {
      return title.compareTo(s.getTitle());
    }

    public String getArtist() {
      return artist;
    }

    public String getBpm() {
      return bpm;
    }

    public String getRating() {
      return rating;
    }

    public String getTitle() {
      return title;
    }

    public String toString() {
      return title;
    }
  }
#+END_SRC

** =SongList.txt=

#+BEGIN_EXAMPLE
  Pink Moon/Nick Drake
  Somersault/Zero 7
  Shiva Moon/Prem Joshua
  Circles/BT
  Deep Channel/Afro Celts
  Passenger/Headmix
  Listen/Tahiti 80
#+END_EXAMPLE

** =SongListMore.txt=

#+BEGIN_EXAMPLE
  Pink Moon/Nick Drake/5/80
  Somersault/Zero 7/4/84
  Shiva Moon/Prem Joshua/6/120
  Circles/BT/5/110
  Deep Channel/Afro Celts/4/120
  Passenger/Headmix/4/100
  Listen/Tahiti 80/5/90
  Listen/Tahiti 80/5/90
  Listen/Tahiti 80/5/90
  Circles/BT/5/110
#+END_EXAMPLE
* 17 Release Your Code: /packaging and deployment/

- no code

* 18 Distributed Computing: /RMI with a dash of servlets, EJB, and Jini/

