programming/java/code/head-first/head-first.html

<div id="outline-container-org1e09699" class="outline-3">
<h3 id="org1e09699"><code>chap16/Song.java</code></h3>
<div class="outline-text-3" id="text-org1e09699">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">package chap16;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Song</span> <span style="color: #56b4e9; font-weight: bold;">implements</span> <span style="color: #0072b2; font-weight: bold;">Comparable</span>&lt;<span style="color: #0072b2; font-weight: bold;">Song</span>&gt; {
<span class="linenr"> 4: </span>  <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">title</span>;
<span class="linenr"> 5: </span>  <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">artist</span>;
<span class="linenr"> 6: </span>  <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">rating</span>;
<span class="linenr"> 7: </span>  <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">bpm</span>;
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>  <span style="color: #848ea9;">/** . */</span>
<span class="linenr">10: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #d55e00;">Song</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">t</span>, <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">a</span>, <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">r</span>, <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">b</span>) {
<span class="linenr">11: </span>    title = t;
<span class="linenr">12: </span>    artist = a;
<span class="linenr">13: </span>    rating = r;
<span class="linenr">14: </span>    bpm = b;
<span class="linenr">15: </span>  }
<span class="linenr">16: </span>
<span class="linenr">17: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">boolean</span> <span style="color: #d55e00;">equals</span>(<span style="color: #0072b2; font-weight: bold;">Object</span> <span style="color: #e69f00; font-weight: bold;">aSong</span>) {
<span class="linenr">18: </span>    <span style="color: #0072b2; font-weight: bold;">Song</span> <span style="color: #e69f00; font-weight: bold;">s</span> = (<span style="color: #0072b2; font-weight: bold;">Song</span>) aSong;
<span class="linenr">19: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> getTitle().equals(s.getTitle());
<span class="linenr">20: </span>  }
<span class="linenr">21: </span>
<span class="linenr">22: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">hashCode</span>() {
<span class="linenr">23: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> title.hashCode();
<span class="linenr">24: </span>  }
<span class="linenr">25: </span>
<span class="linenr">26: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">compareTo</span>(<span style="color: #0072b2; font-weight: bold;">Song</span> <span style="color: #e69f00; font-weight: bold;">s</span>) {
<span class="linenr">27: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> title.compareTo(s.getTitle());
<span class="linenr">28: </span>  }
<span class="linenr">29: </span>
<span class="linenr">30: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">getArtist</span>() {
<span class="linenr">31: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> artist;
<span class="linenr">32: </span>  }
<span class="linenr">33: </span>
<span class="linenr">34: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">getBpm</span>() {
<span class="linenr">35: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> bpm;
<span class="linenr">36: </span>  }
<span class="linenr">37: </span>
<span class="linenr">38: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">getRating</span>() {
<span class="linenr">39: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> rating;
<span class="linenr">40: </span>  }
<span class="linenr">41: </span>
<span class="linenr">42: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">getTitle</span>() {
<span class="linenr">43: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> title;
<span class="linenr">44: </span>  }
<span class="linenr">45: </span>
<span class="linenr">46: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">toString</span>() {
<span class="linenr">47: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> title;
<span class="linenr">48: </span>  }
<span class="linenr">49: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaeb72d4" class="outline-3">
<h3 id="orgaeb72d4"><code>SongList.txt</code></h3>
<div class="outline-text-3" id="text-orgaeb72d4">
<pre class="example">
Pink Moon/Nick Drake
Somersault/Zero 7
Shiva Moon/Prem Joshua
Circles/BT
Deep Channel/Afro Celts
Passenger/Headmix
Listen/Tahiti 80
</pre>
</div>
</div>

<div id="outline-container-orgf65b703" class="outline-3">
<h3 id="orgf65b703"><code>SongListMore.txt</code></h3>
<div class="outline-text-3" id="text-orgf65b703">
<pre class="example">
Pink Moon/Nick Drake/5/80
Somersault/Zero 7/4/84
Shiva Moon/Prem Joshua/6/120
Circles/BT/5/110
Deep Channel/Afro Celts/4/120
Passenger/Headmix/4/100
Listen/Tahiti 80/5/90
Listen/Tahiti 80/5/90
Listen/Tahiti 80/5/90
Circles/BT/5/110
</pre>
</div>
</div>
</div>
<div id="outline-container-orgafbc5ac" class="outline-2">
<h2 id="orgafbc5ac">17 Release Your Code: <i>packaging and deployment</i></h2>
<div class="outline-text-2" id="text-orgafbc5ac">
<ul class="org-ul">
<li>no code</li>
</ul>
</div>
</div>

<div id="outline-container-orgf9f795a" class="outline-2">
<h2 id="orgf9f795a">18 Distributed Computing: <i>RMI with a dash of servlets, EJB, and Jini</i></h2>
<div class="outline-text-2" id="text-orgf9f795a">
</div>
