programming/java/code/head-first/head-first.html
<div id="outline-container-orgd5d0979" class="outline-3">
<h3 id="orgd5d0979"><code>PhraseOMatic2.java</code></h3>
<div class="outline-text-3" id="text-orgd5d0979">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">package chap18;</span>
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">PhraseOMatic2</span> {
<span class="linenr"> 3: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">makePhrase</span>() {
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">make three sets of words to choose from</span>
<span class="linenr"> 6: </span>    <span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">wordListOne</span> = {<span style="color: #848ea9;">"24/7"</span>,<span style="color: #848ea9;">"multi-Tier"</span>,<span style="color: #848ea9;">"30,000 foot"</span>,<span style="color: #848ea9;">"B-to-B"</span>,
<span class="linenr"> 7: </span>                            <span style="color: #848ea9;">"win-win"</span>,<span style="color: #848ea9;">"front-end"</span>, <span style="color: #848ea9;">"web-based"</span>,<span style="color: #848ea9;">"pervasive"</span>,
<span class="linenr"> 8: </span>                            <span style="color: #848ea9;">"smart"</span>, <span style="color: #848ea9;">"six-sigma"</span>,<span style="color: #848ea9;">"critical-path"</span>, <span style="color: #848ea9;">"dynamic"</span>};
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    <span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">wordListTwo</span> = {<span style="color: #848ea9;">"empowered"</span>, <span style="color: #848ea9;">"sticky"</span>, <span style="color: #848ea9;">"valued-added"</span>, <span style="color: #848ea9;">"oriented"</span>,
<span class="linenr">11: </span>                            <span style="color: #848ea9;">"centric"</span>, <span style="color: #848ea9;">"distributed"</span>, <span style="color: #848ea9;">"clustered"</span>, <span style="color: #848ea9;">"branded"</span>,
<span class="linenr">12: </span>                            <span style="color: #848ea9;">"outside-the-box"</span>, <span style="color: #848ea9;">"positioned"</span>, <span style="color: #848ea9;">"networked"</span>,
<span class="linenr">13: </span>                            <span style="color: #848ea9;">"focused"</span>, <span style="color: #848ea9;">"leveraged"</span>, <span style="color: #848ea9;">"aligned"</span>, <span style="color: #848ea9;">"targeted"</span>,
<span class="linenr">14: </span>                            <span style="color: #848ea9;">"shared"</span>, <span style="color: #848ea9;">"cooperative"</span>, <span style="color: #848ea9;">"accelerated"</span>};
<span class="linenr">15: </span>
<span class="linenr">16: </span>    <span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">wordListThree</span> = {<span style="color: #848ea9;">"process"</span>, <span style="color: #848ea9;">"tipping point"</span>, <span style="color: #848ea9;">"solution"</span>,
<span class="linenr">17: </span>                              <span style="color: #848ea9;">"architecture"</span>, <span style="color: #848ea9;">"core competency"</span>, <span style="color: #848ea9;">"strategy"</span>,
<span class="linenr">18: </span>                              <span style="color: #848ea9;">"mindshare"</span>, <span style="color: #848ea9;">"portal"</span>, <span style="color: #848ea9;">"space"</span>, <span style="color: #848ea9;">"vision"</span>,
<span class="linenr">19: </span>                              <span style="color: #848ea9;">"paradigm"</span>, <span style="color: #848ea9;">"mission"</span>};
<span class="linenr">20: </span>
<span class="linenr">21: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">find out how many words are in each list</span>
<span class="linenr">22: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">oneLength</span> = wordListOne.length;
<span class="linenr">23: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">twoLength</span> = wordListTwo.length;
<span class="linenr">24: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">threeLength</span> = wordListThree.length;
<span class="linenr">25: </span>
<span class="linenr">26: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">generate three random numbers, to pull random words from each list</span>
<span class="linenr">27: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">rand1</span> = (<span style="color: #0072b2; font-weight: bold;">int</span>) (Math.random() * oneLength);
<span class="linenr">28: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">rand2</span> = (<span style="color: #0072b2; font-weight: bold;">int</span>) (Math.random() * twoLength);
<span class="linenr">29: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">rand3</span> = (<span style="color: #0072b2; font-weight: bold;">int</span>) (Math.random() * threeLength);
<span class="linenr">30: </span>
<span class="linenr">31: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">now build a phrase</span>
<span class="linenr">32: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">phrase</span> = wordListOne[rand1] + <span style="color: #848ea9;">" "</span> + wordListTwo[rand2] + <span style="color: #848ea9;">" "</span>
<span class="linenr">33: </span>        + wordListThree[rand3];
<span class="linenr">34: </span>
<span class="linenr">35: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">now return it</span>
<span class="linenr">36: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> (<span style="color: #848ea9;">"What we need is a "</span> + phrase);
<span class="linenr">37: </span>  } 
<span class="linenr">38: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f57057" class="outline-3">
<h3 id="org1f57057"><code>KathyServlet.java</code></h3>
<div class="outline-text-3" id="text-org1f57057">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">package chap18;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">IOException</span>;
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">PrintWriter</span>;
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">javax</span>.<span style="color: #d55e00; font-weight: bold;">servlet</span>.<span style="color: #0072b2; font-weight: bold;">ServletException</span>;
<span class="linenr"> 6: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">javax</span>.<span style="color: #d55e00; font-weight: bold;">servlet</span>.<span style="color: #d55e00; font-weight: bold;">http</span>.<span style="color: #0072b2; font-weight: bold;">HttpServlet</span>;
<span class="linenr"> 7: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">javax</span>.<span style="color: #d55e00; font-weight: bold;">servlet</span>.<span style="color: #d55e00; font-weight: bold;">http</span>.<span style="color: #0072b2; font-weight: bold;">HttpServletRequest</span>;
<span class="linenr"> 8: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">javax</span>.<span style="color: #d55e00; font-weight: bold;">servlet</span>.<span style="color: #d55e00; font-weight: bold;">http</span>.<span style="color: #0072b2; font-weight: bold;">HttpServletResponse</span>;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">KathyServlet</span> <span style="color: #56b4e9; font-weight: bold;">extends</span> <span style="color: #0072b2; font-weight: bold;">HttpServlet</span> {
<span class="linenr">11: </span>
<span class="linenr">12: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">doGet</span>(<span style="color: #0072b2; font-weight: bold;">HttpServletRequest</span> <span style="color: #e69f00; font-weight: bold;">request</span>, <span style="color: #0072b2; font-weight: bold;">HttpServletResponse</span> <span style="color: #e69f00; font-weight: bold;">response</span>)
<span class="linenr">13: </span>      <span style="color: #56b4e9; font-weight: bold;">throws</span>  <span style="color: #0072b2; font-weight: bold;">ServletException</span>, <span style="color: #0072b2; font-weight: bold;">IOException</span> {
<span class="linenr">14: </span>
<span class="linenr">15: </span>    <span style="color: #0072b2; font-weight: bold;">PrintWriter</span> <span style="color: #e69f00; font-weight: bold;">out</span>;
<span class="linenr">16: </span>    response.setContentType(<span style="color: #848ea9;">"text/html"</span>);
<span class="linenr">17: </span>    out = response.getWriter();
<span class="linenr">18: </span>    out.println(<span style="color: #848ea9;">"&lt;HTML&gt;&lt;HEAD&gt;&lt;TITLE&gt;"</span>);
<span class="linenr">19: </span>    out.println(<span style="color: #848ea9;">"PhraseOmatic"</span>);
<span class="linenr">20: </span>    out.println(<span style="color: #848ea9;">"&lt;/TITLE&gt;&lt;/HEAD&gt;&lt;BODY&gt;"</span>);
<span class="linenr">21: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">title</span> = <span style="color: #848ea9;">"PhraseOMatic has generated the following phrase."</span>;
<span class="linenr">22: </span>    out.println(<span style="color: #848ea9;">"&lt;H1&gt;"</span> + title + <span style="color: #848ea9;">"&lt;/H1&gt;"</span>);
<span class="linenr">23: </span>    out.println(<span style="color: #848ea9;">"&lt;P&gt;"</span> + PhraseOMatic2.makePhrase());
<span class="linenr">24: </span>    out.println(<span style="color: #848ea9;">"&lt;P&gt;&lt;a href=\"KathyServlet\"&gt;make another phrase&lt;/a&gt;&lt;/p&gt;"</span>);
<span class="linenr">25: </span>    out.println(<span style="color: #848ea9;">"&lt;/BODY&gt;&lt;/HTML&gt;"</span>);
<span class="linenr">26: </span>    out.close();
<span class="linenr">27: </span>  }
<span class="linenr">28: </span>
<span class="linenr">29: </span>}
</pre>
</div>
</div>
</div>
