programming/java/code/head-first/head-first.org
** =ServiceServer.java= (the remote interface)

#+BEGIN_SRC java -n :bangle ServiceServer.java :padline no
  // package chap18;

  import java.rmi.Remote;
  import java.rmi.RemoteException;

  public interface ServiceServer extends Remote {

    Object[] getServiceList() throws RemoteException;

    Service getService(Object serviceKey) throws RemoteException;
  }
#+END_SRC

** =Service.java= (what the GUI services implement)

#+BEGIN_SRC java -n :bangle Service.java :padline no
  // package chap18;

  import java.io.Serializable;
  import javax.swing.JPanel;

  public interface Service extends Serializable {
    public JPanel getGuiPanel();
  }
#+END_SRC

** =ServiceServerImpl.java= (the remote implementation)

#+BEGIN_SRC java -n :bangle ServiceServerImpl.java :padline no
  // package chap18;

  import java.rmi.Naming;
  import java.rmi.Remote;
  import java.rmi.RemoteException;
  import java.rmi.server.UnicastRemoteObject;
  import java.util.HashMap;
  import java.util.Set;

  public class ServiceServerImpl extends UnicastRemoteObject
      implements ServiceServer {

    HashMap<String, Service> serviceList;

    public ServiceServerImpl() throws RemoteException {
      // start and set up services 
      setUpServices();
    }

    private void setUpServices() {
      serviceList = new HashMap<String, Service>();
      serviceList.put("Dice Rolling Service", new DiceService());  
      serviceList.put("Day of the Week Service", new DayOfTheWeekService());  
      serviceList.put("Visual Music Service", new MiniMusicService());   
    }

    public Object[] getServiceList() {
      System.out.println("in remote");
      return serviceList.keySet().toArray();
    }

    public Service getService(Object serviceKey) throws RemoteException {        
      Service theService = (Service) serviceList.get(serviceKey);       
      return theService;
    }

    public static void main(String[] args) {

      try {
        Naming.rebind("ServiceServer", new ServiceServerImpl());
      } catch (Exception ex) {
      }
      System.out.println("Remote service is running");
    }

  }
#+END_SRC

