programming/java/code/head-first/head-first.html

<div id="outline-container-org0790034" class="outline-3">
<h3 id="org0790034"><code>ServiceServer.java</code> (the remote interface)</h3>
<div class="outline-text-3" id="text-org0790034">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">package chap18;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">rmi</span>.<span style="color: #0072b2; font-weight: bold;">Remote</span>;
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">rmi</span>.<span style="color: #0072b2; font-weight: bold;">RemoteException</span>;
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">interface</span> <span style="color: #0072b2; font-weight: bold;">ServiceServer</span> <span style="color: #56b4e9; font-weight: bold;">extends</span> <span style="color: #0072b2; font-weight: bold;">Remote</span> {
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>  <span style="color: #0072b2; font-weight: bold;">Object</span>[] <span style="color: #d55e00;">getServiceList</span>() <span style="color: #56b4e9; font-weight: bold;">throws</span> <span style="color: #0072b2; font-weight: bold;">RemoteException</span>;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>  <span style="color: #0072b2; font-weight: bold;">Service</span> <span style="color: #d55e00;">getService</span>(<span style="color: #0072b2; font-weight: bold;">Object</span> <span style="color: #e69f00; font-weight: bold;">serviceKey</span>) <span style="color: #56b4e9; font-weight: bold;">throws</span> <span style="color: #0072b2; font-weight: bold;">RemoteException</span>;
<span class="linenr">11: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orged4184e" class="outline-3">
<h3 id="orged4184e"><code>Service.java</code> (what the GUI services implement)</h3>
<div class="outline-text-3" id="text-orged4184e">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">package chap18;</span>
<span class="linenr">2: </span>
<span class="linenr">3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">Serializable</span>;
<span class="linenr">4: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">javax</span>.<span style="color: #d55e00; font-weight: bold;">swing</span>.<span style="color: #0072b2; font-weight: bold;">JPanel</span>;
<span class="linenr">5: </span>
<span class="linenr">6: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">interface</span> <span style="color: #0072b2; font-weight: bold;">Service</span> <span style="color: #56b4e9; font-weight: bold;">extends</span> <span style="color: #0072b2; font-weight: bold;">Serializable</span> {
<span class="linenr">7: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">JPanel</span> <span style="color: #d55e00;">getGuiPanel</span>();
<span class="linenr">8: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9094326" class="outline-3">
<h3 id="org9094326"><code>ServiceServerImpl.java</code> (the remote implementation)</h3>
<div class="outline-text-3" id="text-org9094326">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">package chap18;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">rmi</span>.<span style="color: #0072b2; font-weight: bold;">Naming</span>;
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">rmi</span>.<span style="color: #0072b2; font-weight: bold;">Remote</span>;
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">rmi</span>.<span style="color: #0072b2; font-weight: bold;">RemoteException</span>;
<span class="linenr"> 6: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">rmi</span>.<span style="color: #d55e00; font-weight: bold;">server</span>.<span style="color: #0072b2; font-weight: bold;">UnicastRemoteObject</span>;
<span class="linenr"> 7: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">HashMap</span>;
<span class="linenr"> 8: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Set</span>;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ServiceServerImpl</span> <span style="color: #56b4e9; font-weight: bold;">extends</span> <span style="color: #0072b2; font-weight: bold;">UnicastRemoteObject</span>
<span class="linenr">11: </span>    <span style="color: #56b4e9; font-weight: bold;">implements</span> <span style="color: #0072b2; font-weight: bold;">ServiceServer</span> {
<span class="linenr">12: </span>
<span class="linenr">13: </span>  <span style="color: #0072b2; font-weight: bold;">HashMap</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>, <span style="color: #0072b2; font-weight: bold;">Service</span>&gt; <span style="color: #e69f00; font-weight: bold;">serviceList</span>;
<span class="linenr">14: </span>
<span class="linenr">15: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #d55e00;">ServiceServerImpl</span>() <span style="color: #56b4e9; font-weight: bold;">throws</span> <span style="color: #0072b2; font-weight: bold;">RemoteException</span> {
<span class="linenr">16: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">start and set up services </span>
<span class="linenr">17: </span>    setUpServices();
<span class="linenr">18: </span>  }
<span class="linenr">19: </span>
<span class="linenr">20: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">setUpServices</span>() {
<span class="linenr">21: </span>    serviceList = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">HashMap</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>, <span style="color: #0072b2; font-weight: bold;">Service</span>&gt;();
<span class="linenr">22: </span>    serviceList.put(<span style="color: #848ea9;">"Dice Rolling Service"</span>, <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">DiceService</span>());  
<span class="linenr">23: </span>    serviceList.put(<span style="color: #848ea9;">"Day of the Week Service"</span>, <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">DayOfTheWeekService</span>());  
<span class="linenr">24: </span>    serviceList.put(<span style="color: #848ea9;">"Visual Music Service"</span>, <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">MiniMusicService</span>());   
<span class="linenr">25: </span>  }
<span class="linenr">26: </span>
<span class="linenr">27: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">Object</span>[] <span style="color: #d55e00;">getServiceList</span>() {
<span class="linenr">28: </span>    System.out.println(<span style="color: #848ea9;">"in remote"</span>);
<span class="linenr">29: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> serviceList.keySet().toArray();
<span class="linenr">30: </span>  }
<span class="linenr">31: </span>
<span class="linenr">32: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">Service</span> <span style="color: #d55e00;">getService</span>(<span style="color: #0072b2; font-weight: bold;">Object</span> <span style="color: #e69f00; font-weight: bold;">serviceKey</span>) <span style="color: #56b4e9; font-weight: bold;">throws</span> <span style="color: #0072b2; font-weight: bold;">RemoteException</span> {        
<span class="linenr">33: </span>    <span style="color: #0072b2; font-weight: bold;">Service</span> <span style="color: #e69f00; font-weight: bold;">theService</span> = (<span style="color: #0072b2; font-weight: bold;">Service</span>) serviceList.get(serviceKey);       
<span class="linenr">34: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> theService;
<span class="linenr">35: </span>  }
<span class="linenr">36: </span>
<span class="linenr">37: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">38: </span>
<span class="linenr">39: </span>    <span style="color: #56b4e9; font-weight: bold;">try</span> {
<span class="linenr">40: </span>      Naming.rebind(<span style="color: #848ea9;">"ServiceServer"</span>, <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">ServiceServerImpl</span>());
<span class="linenr">41: </span>    } <span style="color: #56b4e9; font-weight: bold;">catch</span> (<span style="color: #0072b2; font-weight: bold;">Exception</span> <span style="color: #e69f00; font-weight: bold;">ex</span>) {
<span class="linenr">42: </span>    }
<span class="linenr">43: </span>    System.out.println(<span style="color: #848ea9;">"Remote service is running"</span>);
<span class="linenr">44: </span>  }
<span class="linenr">45: </span>
<span class="linenr">46: </span>}
</pre>
</div>
</div>
</div>
